require "csv"
    puts "1(新規でメモを作成) 2(既存のメモ編集する)"
    memo_type = gets.to_s.chomp #getsの改行を無視する

#//////////////////////新規ファイル作成/////////////////////////////
if memo_type == "1"
	puts "◆新しいファイル名を入力してください(拡張子のぞく)"
	#----------入力文字からファイルを作る----------
	f_name =  gets.to_s.chomp
	file = File.new(f_name+".csv","w")
	#----------------------------------------------
	puts "◆"+f_name+".CSVにメモしたい文章を入力してください"
	puts "※ [Ctrl+D]で編集終了します"
	#----------追加入力する------------------------
	file.write(gets.to_s)
		
#//////////////////////既存ファイルの編集///////////////////////////
elsif  memo_type == "2"
	puts "◆編集したいCSVファイル名を入力してください(拡張子のぞく)"
	#----------既存のメモファイルを指定------------
	f_name =  gets.to_s.chomp
	file_path = f_name+".csv"
	#----------ファイルの内容を出力----------------
	
	if File.exist?(file_path)
	 file = File.open(file_path,"a+")
	 display = file.read
	 puts ""
	 puts "✄----------------✄【"+f_name+".csv】の内容 ✄---------------✄"
	 p display
	 puts "✄-----------------✄-----------------✄-----------------✄"

	#//////////////////////編集内容/////////////////////////////////
	 puts ""
	 puts "◆追加したい文章を入力してください"
	 puts "※ [Ctrl+D]で編集終了します"
	#----------追加入力する------------------------
	 file.write(gets.to_s)
	 
 	#/////////既存ファイルが見つからなかったら//////////////////////
	else
	 puts ""
	 puts "-人人人人人人人人人人人人-"
	 puts "＞ファイルが存在しません＜"
	 puts "-人人人人人人人人人人人人-"
	 puts ""
	 puts "※ [Ctrl+D]を押してやり直してください"
	end
	
else
	puts "１か２を入力してね(半角)"
	
end

memo = STDIN.read